#+TITLE: Java
#+date: Sun Mar 13 08:23:05 CST 2022
#+categories[]: program_languages
#+tags[]: java
#+summary: Java


** format
#+begin_src java
import java.text.DateFormat;
import java.text.SimpleDateFormat;
import org.apache.commons.lang3.time.DurationFormatUtils;

DateFormat formatter = new SimpleDateFormat("yyyy-MM-dd HH:mm:ss.SSS");
System.out.println(formatter.format(System.currentTimeMillis()));

DurationFormatUtils.formatDuration(millis, "HH:mm:ss.SSS")
#+end_src

#+RESULTS:
: 2022-04-18 20:53:33.000538

